createProductInstance_9.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:Convergys-Interface-ECA-ProductInstance-WSDL" xmlns:urn1="urn:Convergys-Interface-ECA-ProductInstance" xmlns:urn2="urn:Convergys-Interface-CommonIML" xmlns:urn3="urn:Convergys-Interface-ECA" xmlns:urn4="urn:Convergys-Interface-ECA-Account" xmlns:urn5="urn:Convergys-Interface-ECA-Subscription" xmlns:urn6="urn:Convergys-Interface-ECA-EventSource" xmlns:urn7="urn:Convergys-Interface-ECA-RatingTariff" xmlns:urn8="urn:Convergys-Interface-ECA-Address" xmlns:urn9="urn:Convergys-Interface-ECA-Product" xmlns:urn10="urn:Convergys-Interface-ECA-Contact" xmlns:urn11="urn:Convergys-Interface-ECA-BudgetCentre" xmlns:urn12="urn:Convergys-Interface-ECA-Contract" xmlns:urn13="urn:Convergys-Interface-ECA-BillingTariff" xmlns:urn14="urn:Convergys-Interface-ECA-OverridePrice" xmlns:urn15="urn:Convergys-Interface-ECA-OverrideRate">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:createProductInstance_9>
         <urn1:accountPK>
            <urn4:accountNum>:acctNumber</urn4:accountNum>
         </urn1:accountPK>
         <urn1:newProductInstanceData>
            <urn1:newEventSources>
               <urn6:a>
                  <urn6:eventSource>:evSource</urn6:eventSource>
                  <urn6:eventTypeId>:evTypeId</urn6:eventTypeId>
                  <urn6:startDtm>:startDate</urn6:startDtm>
                  <urn6:eventSourceLabel>:evSource</urn6:eventSourceLabel>
                  <urn6:ratingTariffPK>
                     <urn7:ratingTariffId>:prodRatePlanId</urn7:ratingTariffId>
                  </urn6:ratingTariffPK>
                  <urn6:copyGuidingRules>1</urn6:copyGuidingRules>
               </urn6:a>
            </urn1:newEventSources>
            <urn1:serviceAddressData>
               <!--Optional:-->
               <urn1:ustUsedForTaxPurposesBoo>true</urn1:ustUsedForTaxPurposesBoo>
               <!--Optional:-->
               <urn1:productServiceAddressPK>
                  <urn8:customerRef>:custReference</urn8:customerRef>
                  <urn8:addressSeq>1</urn8:addressSeq>
               </urn1:productServiceAddressPK>
            </urn1:serviceAddressData>
            <urn1:productLabel>P1</urn1:productLabel>
            <urn1:productQuantity>1</urn1:productQuantity>
            <urn1:newEventTypes>
               <urn1:a>
                  <urn1:eventTypeId>:evTypeId</urn1:eventTypeId>
                  <urn1:startDat>:startDate</urn1:startDat>
               </urn1:a>
            </urn1:newEventTypes>
            <urn1:productPK>
               <urn9:productId>:prodId</urn9:productId>
            </urn1:productPK>
            <urn1:startDtm>:startDate</urn1:startDtm>
            <urn1:productStatus>0</urn1:productStatus>
            <urn1:contractedPointOfSupplyId>:contractedPoSId</urn1:contractedPointOfSupplyId>
            <urn1:billingTariffPK>
               <urn13:billingTariffId>:prodBillingTariffId</urn13:billingTariffId>
            </urn1:billingTariffPK>
         </urn1:newProductInstanceData>
      </urn:createProductInstance_9>
   </soapenv:Body>
</soapenv:Envelope>
